taciano-pacchialat/Internet-de-las-Cosas/async-web-server/managed_components/tuanpmt__esp_wifi_manager/examples/with_ble/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# Use larger partition table for BLE (requires 4MB+ flash)
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# BLE Configuration
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_CLASSIC_ENABLED=n
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y

# WiFi Manager BLE
CONFIG_WIFI_MGR_ENABLE_BLE=y
CONFIG_WIFI_MGR_BLE_DEVICE_NAME="ESP32-WiFi-{id}"
